// Generated from Xuyu.g4 by ANTLR 4.2.2

	package hx.xuyu;

import org.antlr.v4.runtime.Lexer;
import org.antlr.v4.runtime.CharStream;
import org.antlr.v4.runtime.Token;
import org.antlr.v4.runtime.TokenStream;
import org.antlr.v4.runtime.*;
import org.antlr.v4.runtime.atn.*;
import org.antlr.v4.runtime.dfa.DFA;
import org.antlr.v4.runtime.misc.*;

@SuppressWarnings({"all", "warnings", "unchecked", "unused", "cast"})
public class XuyuLexer extends Lexer {
	protected static final DFA[] _decisionToDFA;
	protected static final PredictionContextCache _sharedContextCache =
		new PredictionContextCache();
	public static final int
		T__1=1, T__0=2, K_HWEI=3, K_YI=4, K_WEI=5, K_YYUN=6, K_ZHONG=7, K_RUO=8, 
		K_FZE=9, K_ZE=10, K_YHUO=11, K_MDANG=12, K_FSHI=13, K_ZHI=14, K_QIU=15, 
		K_YUE=16, K_DE=17, K_DUN=18, K_LSHU=19, K_WEN=20, A_ZHI=21, O_JIN=22, 
		O_TUI=23, O_JI=24, O_FEN=25, O_JIA=26, O_JIAN=27, O_CHENG=28, O_CHU=29, 
		O_YU=30, O_DA=31, O_XIAO=32, O_DENG=33, O_BDA=34, O_BXIAO=35, O_BDENG=36, 
		O_QIE=37, O_HUO=38, O_FEI=39, O_BHAN=40, O_CQU=41, O_BYU=42, INDENT=43, 
		DEDENT=44, COMMENT=45, STRLIT=46, DENT=47, WORD=48, NUM=49, CNFRAC=50, 
		CNNUM=51, CNBOOL=52, CNCHAR=53, NEWLINE=54, WS=55;
	public static String[] modeNames = {
		"DEFAULT_MODE"
	};

	public static final String[] tokenNames = {
		"<INVALID>",
		"'（'", "'）'", "'何为'", "K_YI", "'为'", "'有云'", "'众'", "K_RUO", "'否则'", "'则'", 
		"'抑或'", "'每当'", "'复始'", "'止'", "'求'", "'曰'", "'得'", "'、'", "'历数'", "'问'", 
		"'之'", "'进以'", "'退以'", "'积以'", "'分以'", "'加以'", "'减以'", "'乘以'", "'除以'", 
		"'余以'", "'大于'", "'小于'", "'等于'", "'不大于'", "'不小于'", "'不等于'", "'且'", "'或'", 
		"'非'", "'包含'", "'除去'", "'并于'", "INDENT", "DEDENT", "COMMENT", "STRLIT", 
		"DENT", "WORD", "NUM", "CNFRAC", "CNNUM", "CNBOOL", "CNCHAR", "NEWLINE", 
		"WS"
	};
	public static final String[] ruleNames = {
		"T__1", "T__0", "K_HWEI", "K_YI", "K_WEI", "K_YYUN", "K_ZHONG", "K_RUO", 
		"K_FZE", "K_ZE", "K_YHUO", "K_MDANG", "K_FSHI", "K_ZHI", "K_QIU", "K_YUE", 
		"K_DE", "K_DUN", "K_LSHU", "K_WEN", "A_ZHI", "O_JIN", "O_TUI", "O_JI", 
		"O_FEN", "O_JIA", "O_JIAN", "O_CHENG", "O_CHU", "O_YU", "O_DA", "O_XIAO", 
		"O_DENG", "O_BDA", "O_BXIAO", "O_BDENG", "O_QIE", "O_HUO", "O_FEI", "O_BHAN", 
		"O_CQU", "O_BYU", "INDENT", "DEDENT", "COMMENT", "STRLIT", "DENT", "WORD", 
		"NUM", "CNFRAC", "CNNUM", "CNBOOL", "CNCHAR", "NEWLINE", "WS"
	};



		private LexerIndent li = new LexerIndent(INDENT, DEDENT, DENT, NEWLINE, EOF);
			
		@Override public Token nextToken(){
			Token t = li.getPending();
			while(t == null)t = li.newToken(super.nextToken());
			return t;
		}



	public XuyuLexer(CharStream input) {
		super(input);
		_interp = new LexerATNSimulator(this,_ATN,_decisionToDFA,_sharedContextCache);
	}

	@Override
	public String getGrammarFileName() { return "Xuyu.g4"; }

	@Override
	public String[] getTokenNames() { return tokenNames; }

	@Override
	public String[] getRuleNames() { return ruleNames; }

	@Override
	public String getSerializedATN() { return _serializedATN; }

	@Override
	public String[] getModeNames() { return modeNames; }

	@Override
	public ATN getATN() { return _ATN; }

	public static final String _serializedATN =
		"\3\u0430\ud6d1\u8206\uad2d\u4417\uaef1\u8d80\uaadd\29\u012b\b\1\4\2\t"+
		"\2\4\3\t\3\4\4\t\4\4\5\t\5\4\6\t\6\4\7\t\7\4\b\t\b\4\t\t\t\4\n\t\n\4\13"+
		"\t\13\4\f\t\f\4\r\t\r\4\16\t\16\4\17\t\17\4\20\t\20\4\21\t\21\4\22\t\22"+
		"\4\23\t\23\4\24\t\24\4\25\t\25\4\26\t\26\4\27\t\27\4\30\t\30\4\31\t\31"+
		"\4\32\t\32\4\33\t\33\4\34\t\34\4\35\t\35\4\36\t\36\4\37\t\37\4 \t \4!"+
		"\t!\4\"\t\"\4#\t#\4$\t$\4%\t%\4&\t&\4\'\t\'\4(\t(\4)\t)\4*\t*\4+\t+\4"+
		",\t,\4-\t-\4.\t.\4/\t/\4\60\t\60\4\61\t\61\4\62\t\62\4\63\t\63\4\64\t"+
		"\64\4\65\t\65\4\66\t\66\4\67\t\67\48\t8\3\2\3\2\3\3\3\3\3\4\3\4\3\4\3"+
		"\5\3\5\3\6\3\6\3\7\3\7\3\7\3\b\3\b\3\t\3\t\3\t\3\t\3\t\5\t\u0087\n\t\3"+
		"\n\3\n\3\n\3\13\3\13\3\f\3\f\3\f\3\r\3\r\3\r\3\16\3\16\3\16\3\17\3\17"+
		"\3\20\3\20\3\21\3\21\3\22\3\22\3\23\3\23\3\24\3\24\3\24\3\25\3\25\3\26"+
		"\3\26\3\27\3\27\3\27\3\30\3\30\3\30\3\31\3\31\3\31\3\32\3\32\3\32\3\33"+
		"\3\33\3\33\3\34\3\34\3\34\3\35\3\35\3\35\3\36\3\36\3\36\3\37\3\37\3\37"+
		"\3 \3 \3 \3!\3!\3!\3\"\3\"\3\"\3#\3#\3#\3#\3$\3$\3$\3$\3%\3%\3%\3%\3&"+
		"\3&\3\'\3\'\3(\3(\3)\3)\3)\3*\3*\3*\3+\3+\3+\3,\3,\3-\3-\3.\3.\3.\3.\7"+
		".\u00ef\n.\f.\16.\u00f2\13.\3.\3.\3.\3.\3/\3/\7/\u00fa\n/\f/\16/\u00fd"+
		"\13/\3/\3/\3\60\3\60\3\61\6\61\u0104\n\61\r\61\16\61\u0105\3\62\3\62\7"+
		"\62\u010a\n\62\f\62\16\62\u010d\13\62\3\63\3\63\3\63\5\63\u0112\n\63\3"+
		"\63\3\63\3\63\3\63\3\63\3\63\3\64\6\64\u011b\n\64\r\64\16\64\u011c\3\65"+
		"\3\65\3\66\3\66\3\67\5\67\u0124\n\67\3\67\3\67\38\38\38\38\4\u00f0\u00fb"+
		"\29\3\3\5\4\7\5\t\6\13\7\r\b\17\t\21\n\23\13\25\f\27\r\31\16\33\17\35"+
		"\20\37\21!\22#\23%\24\'\25)\26+\27-\30/\31\61\32\63\33\65\34\67\359\36"+
		";\37= ?!A\"C#E$G%I&K\'M(O)Q*S+U,W-Y.[/]\60_\61a\62c\63e\64g\65i\66k\67"+
		"m8o9\3\2\n\4\2\u4ee7\u4ee7\u670b\u670b\4\2\13\13\"\"\5\2C\\aac|\3\2\63"+
		";\3\2\62;\21\2\u4e02\u4e02\u4e05\u4e05\u4e09\u4e09\u4e0b\u4e0b\u4e5f\u4e5f"+
		"\u4e8e\u4e8e\u4e96\u4e96\u4ec1\u4ec1\u516d\u516d\u516f\u516f\u5343\u5343"+
		"\u5345\u5345\u56dd\u56dd\u7680\u7680\u96f8\u96f8\4\2\u5428\u5428\u7138"+
		"\u7138\5\2\13\f\17\17\"\"\u0133\2\3\3\2\2\2\2\5\3\2\2\2\2\7\3\2\2\2\2"+
		"\t\3\2\2\2\2\13\3\2\2\2\2\r\3\2\2\2\2\17\3\2\2\2\2\21\3\2\2\2\2\23\3\2"+
		"\2\2\2\25\3\2\2\2\2\27\3\2\2\2\2\31\3\2\2\2\2\33\3\2\2\2\2\35\3\2\2\2"+
		"\2\37\3\2\2\2\2!\3\2\2\2\2#\3\2\2\2\2%\3\2\2\2\2\'\3\2\2\2\2)\3\2\2\2"+
		"\2+\3\2\2\2\2-\3\2\2\2\2/\3\2\2\2\2\61\3\2\2\2\2\63\3\2\2\2\2\65\3\2\2"+
		"\2\2\67\3\2\2\2\29\3\2\2\2\2;\3\2\2\2\2=\3\2\2\2\2?\3\2\2\2\2A\3\2\2\2"+
		"\2C\3\2\2\2\2E\3\2\2\2\2G\3\2\2\2\2I\3\2\2\2\2K\3\2\2\2\2M\3\2\2\2\2O"+
		"\3\2\2\2\2Q\3\2\2\2\2S\3\2\2\2\2U\3\2\2\2\2W\3\2\2\2\2Y\3\2\2\2\2[\3\2"+
		"\2\2\2]\3\2\2\2\2_\3\2\2\2\2a\3\2\2\2\2c\3\2\2\2\2e\3\2\2\2\2g\3\2\2\2"+
		"\2i\3\2\2\2\2k\3\2\2\2\2m\3\2\2\2\2o\3\2\2\2\3q\3\2\2\2\5s\3\2\2\2\7u"+
		"\3\2\2\2\tx\3\2\2\2\13z\3\2\2\2\r|\3\2\2\2\17\177\3\2\2\2\21\u0086\3\2"+
		"\2\2\23\u0088\3\2\2\2\25\u008b\3\2\2\2\27\u008d\3\2\2\2\31\u0090\3\2\2"+
		"\2\33\u0093\3\2\2\2\35\u0096\3\2\2\2\37\u0098\3\2\2\2!\u009a\3\2\2\2#"+
		"\u009c\3\2\2\2%\u009e\3\2\2\2\'\u00a0\3\2\2\2)\u00a3\3\2\2\2+\u00a5\3"+
		"\2\2\2-\u00a7\3\2\2\2/\u00aa\3\2\2\2\61\u00ad\3\2\2\2\63\u00b0\3\2\2\2"+
		"\65\u00b3\3\2\2\2\67\u00b6\3\2\2\29\u00b9\3\2\2\2;\u00bc\3\2\2\2=\u00bf"+
		"\3\2\2\2?\u00c2\3\2\2\2A\u00c5\3\2\2\2C\u00c8\3\2\2\2E\u00cb\3\2\2\2G"+
		"\u00cf\3\2\2\2I\u00d3\3\2\2\2K\u00d7\3\2\2\2M\u00d9\3\2\2\2O\u00db\3\2"+
		"\2\2Q\u00dd\3\2\2\2S\u00e0\3\2\2\2U\u00e3\3\2\2\2W\u00e6\3\2\2\2Y\u00e8"+
		"\3\2\2\2[\u00ea\3\2\2\2]\u00f7\3\2\2\2_\u0100\3\2\2\2a\u0103\3\2\2\2c"+
		"\u0107\3\2\2\2e\u0111\3\2\2\2g\u011a\3\2\2\2i\u011e\3\2\2\2k\u0120\3\2"+
		"\2\2m\u0123\3\2\2\2o\u0127\3\2\2\2qr\7\uff0a\2\2r\4\3\2\2\2st\7\uff0b"+
		"\2\2t\6\3\2\2\2uv\7\u4f57\2\2vw\7\u4e3c\2\2w\b\3\2\2\2xy\t\2\2\2y\n\3"+
		"\2\2\2z{\7\u4e3c\2\2{\f\3\2\2\2|}\7\u670b\2\2}~\7\u4e93\2\2~\16\3\2\2"+
		"\2\177\u0080\7\u4f19\2\2\u0080\20\3\2\2\2\u0081\u0087\7\u82e7\2\2\u0082"+
		"\u0083\7\u5984\2\2\u0083\u0087\7\u82e7\2\2\u0084\u0085\7\u501a\2\2\u0085"+
		"\u0087\7\u82e7\2\2\u0086\u0081\3\2\2\2\u0086\u0082\3\2\2\2\u0086\u0084"+
		"\3\2\2\2\u0087\22\3\2\2\2\u0088\u0089\7\u5428\2\2\u0089\u008a\7\u521b"+
		"\2\2\u008a\24\3\2\2\2\u008b\u008c\7\u521b\2\2\u008c\26\3\2\2\2\u008d\u008e"+
		"\7\u6293\2\2\u008e\u008f\7\u6218\2\2\u008f\30\3\2\2\2\u0090\u0091\7\u6bd1"+
		"\2\2\u0091\u0092\7\u5f55\2\2\u0092\32\3\2\2\2\u0093\u0094\7\u590f\2\2"+
		"\u0094\u0095\7\u59cd\2\2\u0095\34\3\2\2\2\u0096\u0097\7\u6b64\2\2\u0097"+
		"\36\3\2\2\2\u0098\u0099\7\u6c44\2\2\u0099 \3\2\2\2\u009a\u009b\7\u66f2"+
		"\2\2\u009b\"\3\2\2\2\u009c\u009d\7\u5f99\2\2\u009d$\3\2\2\2\u009e\u009f"+
		"\7\u3003\2\2\u009f&\3\2\2\2\u00a0\u00a1\7\u5388\2\2\u00a1\u00a2\7\u6572"+
		"\2\2\u00a2(\3\2\2\2\u00a3\u00a4\7\u95f0\2\2\u00a4*\3\2\2\2\u00a5\u00a6"+
		"\7\u4e4d\2\2\u00a6,\3\2\2\2\u00a7\u00a8\7\u8fdd\2\2\u00a8\u00a9\7\u4ee7"+
		"\2\2\u00a9.\3\2\2\2\u00aa\u00ab\7\u9002\2\2\u00ab\u00ac\7\u4ee7\2\2\u00ac"+
		"\60\3\2\2\2\u00ad\u00ae\7\u79f1\2\2\u00ae\u00af\7\u4ee7\2\2\u00af\62\3"+
		"\2\2\2\u00b0\u00b1\7\u5208\2\2\u00b1\u00b2\7\u4ee7\2\2\u00b2\64\3\2\2"+
		"\2\u00b3\u00b4\7\u52a2\2\2\u00b4\u00b5\7\u4ee7\2\2\u00b5\66\3\2\2\2\u00b6"+
		"\u00b7\7\u51d1\2\2\u00b7\u00b8\7\u4ee7\2\2\u00b88\3\2\2\2\u00b9\u00ba"+
		"\7\u4e5a\2\2\u00ba\u00bb\7\u4ee7\2\2\u00bb:\3\2\2\2\u00bc\u00bd\7\u9666"+
		"\2\2\u00bd\u00be\7\u4ee7\2\2\u00be<\3\2\2\2\u00bf\u00c0\7\u4f5b\2\2\u00c0"+
		"\u00c1\7\u4ee7\2\2\u00c1>\3\2\2\2\u00c2\u00c3\7\u5929\2\2\u00c3\u00c4"+
		"\7\u4e90\2\2\u00c4@\3\2\2\2\u00c5\u00c6\7\u5c11\2\2\u00c6\u00c7\7\u4e90"+
		"\2\2\u00c7B\3\2\2\2\u00c8\u00c9\7\u7b4b\2\2\u00c9\u00ca\7\u4e90\2\2\u00ca"+
		"D\3\2\2\2\u00cb\u00cc\7\u4e0f\2\2\u00cc\u00cd\7\u5929\2\2\u00cd\u00ce"+
		"\7\u4e90\2\2\u00ceF\3\2\2\2\u00cf\u00d0\7\u4e0f\2\2\u00d0\u00d1\7\u5c11"+
		"\2\2\u00d1\u00d2\7\u4e90\2\2\u00d2H\3\2\2\2\u00d3\u00d4\7\u4e0f\2\2\u00d4"+
		"\u00d5\7\u7b4b\2\2\u00d5\u00d6\7\u4e90\2\2\u00d6J\3\2\2\2\u00d7\u00d8"+
		"\7\u4e16\2\2\u00d8L\3\2\2\2\u00d9\u00da\7\u6218\2\2\u00daN\3\2\2\2\u00db"+
		"\u00dc\7\u9760\2\2\u00dcP\3\2\2\2\u00dd\u00de\7\u5307\2\2\u00de\u00df"+
		"\7\u542d\2\2\u00dfR\3\2\2\2\u00e0\u00e1\7\u9666\2\2\u00e1\u00e2\7\u53bd"+
		"\2\2\u00e2T\3\2\2\2\u00e3\u00e4\7\u5e78\2\2\u00e4\u00e5\7\u4e90\2\2\u00e5"+
		"V\3\2\2\2\u00e6\u00e7\3\2\2\2\u00e7X\3\2\2\2\u00e8\u00e9\3\2\2\2\u00e9"+
		"Z\3\2\2\2\u00ea\u00eb\7\u2028\2\2\u00eb\u00ec\7\u2028\2\2\u00ec\u00f0"+
		"\3\2\2\2\u00ed\u00ef\13\2\2\2\u00ee\u00ed\3\2\2\2\u00ef\u00f2\3\2\2\2"+
		"\u00f0\u00f1\3\2\2\2\u00f0\u00ee\3\2\2\2\u00f1\u00f3\3\2\2\2\u00f2\u00f0"+
		"\3\2\2\2\u00f3\u00f4\5m\67\2\u00f4\u00f5\3\2\2\2\u00f5\u00f6\b.\2\2\u00f6"+
		"\\\3\2\2\2\u00f7\u00fb\7\u300e\2\2\u00f8\u00fa\13\2\2\2\u00f9\u00f8\3"+
		"\2\2\2\u00fa\u00fd\3\2\2\2\u00fb\u00fc\3\2\2\2\u00fb\u00f9\3\2\2\2\u00fc"+
		"\u00fe\3\2\2\2\u00fd\u00fb\3\2\2\2\u00fe\u00ff\7\u300f\2\2\u00ff^\3\2"+
		"\2\2\u0100\u0101\t\3\2\2\u0101`\3\2\2\2\u0102\u0104\t\4\2\2\u0103\u0102"+
		"\3\2\2\2\u0104\u0105\3\2\2\2\u0105\u0103\3\2\2\2\u0105\u0106\3\2\2\2\u0106"+
		"b\3\2\2\2\u0107\u010b\t\5\2\2\u0108\u010a\t\6\2\2\u0109\u0108\3\2\2\2"+
		"\u010a\u010d\3\2\2\2\u010b\u0109\3\2\2\2\u010b\u010c\3\2\2\2\u010cd\3"+
		"\2\2\2\u010d\u010b\3\2\2\2\u010e\u010f\5g\64\2\u010f\u0110\7\u53ca\2\2"+
		"\u0110\u0112\3\2\2\2\u0111\u010e\3\2\2\2\u0111\u0112\3\2\2\2\u0112\u0113"+
		"\3\2\2\2\u0113\u0114\5g\64\2\u0114\u0115\7\u5208\2\2\u0115\u0116\7\u4e4d"+
		"\2\2\u0116\u0117\3\2\2\2\u0117\u0118\5g\64\2\u0118f\3\2\2\2\u0119\u011b"+
		"\t\7\2\2\u011a\u0119\3\2\2\2\u011b\u011c\3\2\2\2\u011c\u011a\3\2\2\2\u011c"+
		"\u011d\3\2\2\2\u011dh\3\2\2\2\u011e\u011f\t\b\2\2\u011fj\3\2\2\2\u0120"+
		"\u0121\4\u4e02\ua001\2\u0121l\3\2\2\2\u0122\u0124\7\17\2\2\u0123\u0122"+
		"\3\2\2\2\u0123\u0124\3\2\2\2\u0124\u0125\3\2\2\2\u0125\u0126\7\f\2\2\u0126"+
		"n\3\2\2\2\u0127\u0128\t\t\2\2\u0128\u0129\3\2\2\2\u0129\u012a\b8\2\2\u012a"+
		"p\3\2\2\2\13\2\u0086\u00f0\u00fb\u0105\u010b\u0111\u011c\u0123\3\b\2\2";
	public static final ATN _ATN =
		new ATNDeserializer().deserialize(_serializedATN.toCharArray());
	static {
		_decisionToDFA = new DFA[_ATN.getNumberOfDecisions()];
		for (int i = 0; i < _ATN.getNumberOfDecisions(); i++) {
			_decisionToDFA[i] = new DFA(_ATN.getDecisionState(i), i);
		}
	}
}